# Data frame part 3

In [1]:
import pandas as pd

In [2]:
bond=pd.read_csv("jamesbond.csv")
bond.head(3)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

# The .set_index() and .reset_index() Method

In [3]:
bond.set_index("Film", inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [4]:
bond.reset_index().head(3)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [5]:
bond.reset_index(drop = False , inplace = True)
bond.head(3)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [6]:
import pandas as pd
bond=pd.read_csv("jamesbond.csv")
bond.set_index("Film",inplace =True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [7]:
bond.reset_index(inplace=True)
bond.set_index("Year",inplace  = True)

In [8]:
bond.head(3)

,Film,Actor,Director,Box Office,Budget,Bond Actor Salary
Year,,,,,,
1962,Dr. No,Sean Connery,Terence Young,448.8,7.0,0.6
1963,From Russia with Love,Sean Connery,Terence Young,543.8,12.6,1.6
1964,Goldfinger,Sean Connery,Guy Hamilton,820.4,18.6,3.2

# Retrieve Rows by Index Label with .loc[ ]

In [9]:
bond = pd.read_csv("jamesbond.csv" , index_col = "Film")
bond.sort_index(inplace  =True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [10]:
bond.loc["Goldfinger"]
bond.loc["GoldenEye"]
#bond.loc["Sacred Bond"]
bond.loc["Casino Royale"]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [11]:
bond.loc["Diamonds Are Forever" : "Moonrraker"].head()

bond.loc["GoldenEye" :].head()# start from goldeneye
bond.loc[: "GoldenEye"].tail() # till goldeneye

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1

In [12]:
bond.loc[["Moonraker" , "Octopussy"]]
# or
bond.loc[["Octopussy", "Moonraker"]]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN

In [13]:
bond.loc[["For Your Eyes only ","Live and Let Die" , "Gold Bond"]]
#here the gold bond is not persent in our list of movie the pandas automatically added this

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
For Your Eyes only,NaN,NaN,NaN,NaN,NaN,NaN
Live and Let Die,1973.0,Roger Moore,Guy Hamilton,460.3,30.8,NaN
Gold Bond,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
"Gold Bond" in bond.index

False

# Retrrieve Row(s) by index Position with iloc

In [15]:
bond = pd.read_csv("jamesbond.csv")
bond.iloc[15]
bond.iloc[[15,20]]

#``.iloc[]`` is primarily integer position based (from ``0`` to
#``length-1`` of the axis), but may also be used with a boolean
#array.'''

bond.iloc[:4]
bond.iloc[4:8]

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
7,Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8

In [16]:
bond.iloc[15:20]

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
16,The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
17,Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
18,GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
19,Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10.0

In [17]:
bond.iloc[[5,10,15,20]]

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
5,You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
10,The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN
15,A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
20,The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5

# the Catch-All .ix[ ] Method

In [18]:
bond = pd.read_csv("jamesbond.csv" , index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)
#Ix menthod is used to replace the both loc and iloc

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [19]:
bond.ix["GoldenEye"]
bond.ix[["Diamonds are Forever" , "Moonraker" , "Spectre"]]
bond.ix["A View to a Kill": "The World Is Not Enough"].tail(5)
#Till the movie The WOrld is not enough is not come in the list|
# bond.ix["Sacred Bond"]the listed movie is does not exist gives  the errror
bond.ix[["Spectre","Sacred Bond"]]

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Spectre,2015.0,Daniel Craig,Sam Mendes,726.7,206.3,NaN
Sacred Bond,NaN,NaN,NaN,NaN,NaN,NaN

In [20]:
"Spectre" in bond.index
"Sacred Bond" in bond.index # not present in the list

False

In [21]:
bond.ix[10]
bond.ix[10:15]
bond.ix[[8,16,24]]
#bond.x[100]
bond.ix[[8,30]]# Givves the error because it is out of lenght of list

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """

IndexError: indices are out-of-bounds

In [ ]:
bond.loc["Moonraker",["Actor" , "Budget" , "Year"]]

In [ ]:
bond.iloc[14,2:5]

In [ ]:
bond.ix[20 , "Budget"]
bond.ix["The Man with the Golden Gun" , :4]
bond.ix[5,3]

In [ ]:
bond.ix["Dr. No"]

In [ ]:
#bond.ix["Dr. No" ,"Actor"]=" Sir Sean Connery"

In [ ]:
#bond.ix["Dr. No"]

In [ ]:
bond.ix["Dr. No",["Box Office" , "Budget" , "Bond Actor Salary"]]=[448800000,7000000,600000]

In [ ]:
bond.ix["Dr. No","Budget"]

# Set Multiple Values in DataFrame

In [ ]:
bond.head(3)

In [ ]:
bond

In [ ]:
mask=bond["Actor"]=="Sean Connery"

In [ ]:
df2=bond[mask]
df2["Actor"]=="Sir Sean Connery "
df2 #This method is not changing the  original data

In [ ]:
bond.ix[mask,"Actor"]=="Sir Sean Connerry"

In [ ]:
bond[bond["Actor"]== "Roger Moore"]

In [ ]:
bond.ix[bond["Actor"]=="Rogger Morse"]
bond

# Rename Index Labesl or Columns in a DataFrame

In [ ]:
bond.rename(columns = {"Year":"Release Date","Box Office":"Revenue"},inplace = True)

In [ ]:
bond.head(3)

In [ ]:
bond.rename(index = {"Dr. No":"Doctor No","GoldenEye":"Gloden Eye",
                    "The World Is Not Enough":'Best Bond Movie Ever'} , inplace = True)

In [ ]:
bond.ix["Best Bond Movie Ever"]

In [ ]:
bond.head(1)

In [ ]:
bond.columns  =["Year of Release" , "Actor","Director" , "Gross" , "Cost","Salary"]

In [ ]:
bond.head(1)

# Delete Rows or Columns from a DataFrame

In [ ]:
bond = pd.read_csv("jamesbond.csv" , index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

In [ ]:
bond.drop(["A View to a Kill" , "Die Another Day","Casino Royale"]).head(2)

In [ ]:
bond.drop(labels=["Box Office","Bond Actor Salary" ,"Actor"],axis = "columns",inplace =True)

In [ ]:
bond.head(3)

In [ ]:
actor=bond.pop("Budget")
#Return item and also  can store the value in new variable . Raise KeyError if not found.

In [ ]:
bond.head(2)

In [ ]:
bond = pd.read_csv("jamesbond.csv" , index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

In [ ]:
del bond["Director"]

In [ ]:
del bond["Year"]

In [ ]:
bond.head(3)# removed the Director and Year

# Create Random Sample

In [ ]:
bond.sample()

In [ ]:
bond.sample(n=5)

In [ ]:
bond.sample(frac = .25)
# bond.sample(n=None, frac=None(Takes the persentage of total no. of values), replace=False, weights=None, random_state=None, axis=None)

In [ ]:
bond.sample(n=3 , axis ="index")

In [ ]:
bond.sample(n =3 , axis = "columns").head()

# The .nsamllestt() and .nlargest() Mehtod

In [ ]:
bond.sort_values("Box Office",ascending  =False).head(3)

In [ ]:
bond.nlargest(3 , columns = 'Box Office')

In [ ]:
bond.nsmallest(n=2 , columns = "Box Office")

In [ ]:
bond.nlargest(3 , columns = "Budget")

In [ ]:
bond.nsmallest(3,columns = "Bond Actor Salary")

In [56]:
bond["Box Office"].nlargest(8)

Film
Skyfall                  943.5
Thunderball              848.1
Goldfinger               820.4
Spectre                  726.7
Casino Royale            581.5
From Russia with Love    543.8
Moonraker                535.0
The Spy Who Loved Me     533.0
Name: Box Office, dtype: float64

In [22]:
bond = pd.read_csv("jamesbond.csv" , index_col = "Film")
bond.sort_index(inplace = True)

bond["Year"].nsmallest(2)
#I have remove the Year coloumns before so it is giving me an error

Film
Dr. No                   1962
From Russia with Love    1963
Name: Year, dtype: int64

# Filtering with the where Method

In [23]:
import pandas as pd
bond = pd.read_csv("jamesbond.csv" , index_col = "Film")
bond.sort_index(inplace = True)
mask = bond["Actor"]=="Sean Connery"

In [24]:
bond[mask].head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN

In [25]:
# bond.where(mask).head() # only the sean connery value is true  and all othe are NAN

In [26]:
mask2 = bond.where(bond["Box Office"] > 800).head() #all the value is NAN where the value is greter than 800

In [27]:
mask2 = bond["Box Office"] > 800

In [28]:
bond.where(mask & mask2).head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Diamonds Are Forever,NaN,NaN,NaN,NaN,NaN,NaN
Die Another Day,NaN,NaN,NaN,NaN,NaN,NaN

# The .query( ) Method

In [29]:
bond.column = [column_name.replace(" " , "_")for column_name in bond.columns]
bond.head(2)
#Query method can only be used with the underscore sepreted values not with the space sepreted"

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3

In [30]:
bond.query('Actor == "Sean Connery"')
bond.query("Director=='Terence Young'")
bond.query("Actor!= 'Roger Moore'").head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6

In [31]:
bond.query("Actor == 'Roger Moore' or Director == 'John Glen' ").head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN

In [32]:
bond.query("Actor in ['Timothy Dalton' , 'George Lazenby']")
bond.query("Actor not in ['Sean Connery','Roger Moore']").head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9

# A Review of the .apply() Method on Single Columns

In [33]:
def convert_to_string_and_add_millions(number):
    return str(number) +"MILLIONS!"
bond["Box Office"]= bond["Box Office"].apply(convert_to_string_and_add_millions)

In [34]:
bond["Budget"]=bond['Budget'].apply(convert_to_string_and_add_millions)
columns = ["Box Office",'Budget',"Bond Actor Salary"]
for col in columns:
    bond[col].apply(convert_to_string_and_add_millions)

In [35]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2MILLIONS!,54.5MILLIONS!,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5MILLIONS!,145.3MILLIONS!,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0MILLIONS!,85.0MILLIONS!,NaN

# The .apply( ) Method with Row Values

In [36]:
bond  = pd.read_csv("jamesbond.csv" , index_col = "Film")
bond.sort_index(inplace= True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [37]:
def good_movie(row):
    actor =row[1]
    budget = row[4]
    
    if actor=="Pierce Brosnah":
        return "The Best"
    elif actor=="Roger Moore" and budget >40:
        return "Enjoyable"
    else:
        return "I have no clue"
bond.apply(good_movie , axis  = "columns")

Film
A View to a Kill                        Enjoyable
Casino Royale                      I have no clue
Casino Royale                      I have no clue
Diamonds Are Forever               I have no clue
Die Another Day                    I have no clue
Dr. No                             I have no clue
For Your Eyes Only                      Enjoyable
From Russia with Love              I have no clue
GoldenEye                          I have no clue
Goldfinger                         I have no clue
Licence to Kill                    I have no clue
Live and Let Die                   I have no clue
Moonraker                               Enjoyable
Never Say Never Again              I have no clue
Octopussy                               Enjoyable
On Her Majesty's Secret Service    I have no clue
Quantum of Solace                  I have no clue
Skyfall                            I have no clue
Spectre                            I have no clue
The Living Daylights               I have no clue
The Man with the Golden Gun        I have no clue
The Spy Who Loved Me                    Enjoyable
The World Is Not Enough            I have no clue
Thunderball                        I have no clue
Tomorrow Never Dies                I have no clue
You Only Live Twice                I have no clue
dtype: object

# the .copy Method

In [45]:
directors=bond["Director"]
directors.head(3)

Film
A View to a Kill    Mister John Glen
Casino Royale        Martin Campbell
Casino Royale             Ken Hughes
Name: Director, dtype: object

In [39]:
directors["A View to a Kill"]

'John Glen'

In [42]:
directors["A View to a Kill"]="Mister John Glen" # This method is not effective bec. it harms the original value of data

C:\Users\dell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [43]:
directors.head(3)

Film
A View to a Kill    Mister John Glen
Casino Royale        Martin Campbell
Casino Royale             Ken Hughes
Name: Director, dtype: object

In [44]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Mister John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [46]:
bond  = pd.read_csv("jamesbond.csv" , index_col = "Film")
bond.sort_index(inplace= True)
directors = bond["Director"].copy()
directors.head(3)

Film
A View to a Kill          John Glen
Casino Royale       Martin Campbell
Casino Royale            Ken Hughes
Name: Director, dtype: object

In [53]:
directors['A View to a Kill']="Mister John Glen"# original copy and not impacting the original data

In [54]:
directors.head(3)

Film
A View to a Kill    Mister John Glen
Casino Royale        Martin Campbell
Casino Royale             Ken Hughes
Name: Director, dtype: object

In [55]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN